# AI Qualified Ordering Specialist
## Компетенции
### 1. Способен применять знания об истории развития и трендах современного ИИ для формулирования корректных постановок задач и поиска перспективных способов решения проблем с помощью ИИ.
#### "Трудовая функция"
Выполнить декомпозицию проблемы на составные части, содержащие компактные ИИ-решения (для дальнейшей проработки архитектором ИИ)
#### Индикаторы
* Позиционирует собственную задачу в заданной области знания c точки зрения основных трендов современного искусственного интеллекта
* Определяет тенденции развития, оценивает новизну и практическую значимость своих решений с точки зрения современного искусственного интеллекта
* Оценивает конкурирующие решения и разработки с точки зрения основных трендов современного искусственного интеллекта
### 2. Способен проводить анализ бизнес-проблем с оценкой перспективности применения ИИ для их решения, осуществлять постановку задачи машинного обучения, формулировать требования к системе ИИ
#### "Трудовая функция" и индикатор
Определить и формализовать проблему предметной области, решение которой требует применения ИИ
### 3. Способен проводить анализ бизнес-проблем с оценкой перспективности применения ИИ для их решения, осуществлять постановку задачи машинного обучения, формулировать требования к системе ИИ
#### "Трудовая функция"
Определить парадигму и класс решений ИИ, высокоуровневые требования к математическому и программному обеспечению для решения поставленной задачи
#### Индикаторы
Определяет парадигму и класс решений ИИ, высокоуровневые требования к математическому и программному обеспечению для решения поставленной задачи
### 4. Способен управлять процессом жизненного цикла ИИ-продукта
#### "Трудовая функция"
Определить метрики качества и правила их применения (оценки и пр.)
#### Индикаторы
Управляет требованиями к системам искусственного интеллекта, в том числе определяет метрики качества и правила их применения и оценки
### 5. Способен проводить анализ бизнес-проблем с оценкой перспективности применения ИИ для их решения, осуществлять постановку задачи машинного обучения, формулировать требования к системе ИИ
#### "Трудовая функция"
Разрабатывать и оценивать технические требования (техническое задание) на системы с ИИ в конкретной предметной области
#### Индикаторы
Оценивает технические требования и разрабатывает техническое задание на системы искусственного интеллекта в конкретной предметной области
### 6. Способен проводить эксперименты на данных, формулировать гипотезы исследования, строить (обучать, дообучать) модели машинного обучения с оценкой их качества и анализом ошибок, обеспечивать воспроизводимость и масштабируемость исследований на данных
#### "Трудовая функция"
Разрабатывать ПиМ, проводить испытания, обеспечивать приемку результатов работ
#### Индикаторы
Тестирует, испытывает и оценивает качество решений с элементами искусственного интеллекта
